{"Binary_code": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/a/af/Binary_to_Hexadecimal_or_Decimal.jpg\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>A <b>binary code</b> is the value of a data-encoding convention represented in a binary notation that usually is a sequence of 0s and 1s; sometimes called a <i>bit string</i>. For example, ASCII is an 8-bit text encoding that in addition to the human readable form (letters) can be represented as binary. <i>Binary code</i> can also refer to the mass noun <i>code</i> that is not human readable in nature such as machine code and bytecode.</p>", "Machine_code": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/W65C816S_Machine_Code_Monitor.jpeg/330px-W65C816S_Machine_Code_Monitor.jpeg\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>In computing, <b>machine code</b> is data encoded and structured to control a computer's central processing unit (CPU) via its programmable interface. A computer program consists primarily of sequences of machine-code instructions. Machine code is classified as native with respect to its host CPU since it is the language that CPU interprets directly. A software interpreter is a virtual machine that processes virtual machine code.</p>", "Coding_best_practices": "<p><b>Coding best practices</b> or <b>programming best practices</b> are a set of informal, sometimes personal, rules that many software developers, in computer programming follow to improve software quality. Many computer programs require being robust and reliable for long periods of time, so any rules need to facilitate both initial development and subsequent maintenance of source code by people other than the original authors.</p>", "Central_processing_unit": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Intel_i9-14900KF_CPU.jpg/330px-Intel_i9-14900KF_CPU.jpg\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>A <b>central processing unit</b> (<b>CPU</b>), also called a <b>central processor</b>, <b>main processor</b>, or just <b>processor</b>, is the primary processor in a given computer. Its electronic circuitry executes instructions of a computer program, such as arithmetic, logic, controlling, and input/output (I/O) operations. This role contrasts with that of external components, such as main memory and I/O circuitry, and specialized coprocessors such as graphics processing units (GPUs).</p>", "C%2B%2B": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/ISO_C%2B%2B_Logo.svg/320px-ISO_C%2B%2B_Logo.svg.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p><b>C++</b> is a high-level, general-purpose programming language created by Danish computer scientist Bjarne Stroustrup. First released in 1985 as an extension of the C programming language, adding object-oriented (OOP) features, it has since expanded significantly over time adding more OOP and other features; as of 1997/C++98 standardization, C++ has added functional features, in addition to facilities for low-level memory manipulation for systems like microcomputers or to make operating systems like Linux or Windows, and even later came features like generic programming. C++ is usually implemented as a compiled language, and many vendors provide C++ compilers, including the Free Software Foundation, LLVM, Microsoft, Intel, Embarcadero, Oracle, and IBM.</p>", "Syntax_(programming_languages)": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Python_add5_syntax.svg/330px-Python_add5_syntax.svg.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>The <b>syntax</b> of computer source code is the form that it has – specifically without concern for what it means (semantics). Like a natural language, a computer language defines the syntax that is valid for that language. A syntax error occurs when syntactically invalid source code is processed by an tool such as a compiler or interpreter.</p>", "Camel_case": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/CamelCase_new.svg/330px-CamelCase_new.svg.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>The writing format <b>camel case</b> is the practice of writing phrases without spaces or punctuation and with capitalized words. The format indicates the first word starting with either case, then the following words having an initial uppercase letter. Common examples include <i>YouTube</i>, <i>PowerPoint</i>, <i>HarperCollins</i>, <i>FedEx</i>, <i>iPhone</i>, <i>eBay</i>, and <i>LaGuardia</i>. Camel case is often used as a naming convention in computer programming. It is also sometimes used in online usernames such as <i>JohnSmith</i>, and to make multi-word domain names more legible, for example in promoting <i>EasyWidgetCompany.com</i>.</p>", "%22Hello,_World!%22_program": "<p>\nA <b>\"Hello, World!\" program</b> is usually a simple computer program that emits to the screen a message similar to \"Hello, World!\". A small piece of code in most general-purpose programming languages, this program is used to illustrate a language's basic syntax. Such a program is often the first written by a student of a new programming language, but it can also be used as a sanity check to ensure that the computer software intended to compile or run source code is correctly installed, and that its operator understands how to use it.</p>", "Executable": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Binary_executable_file2.png/330px-Binary_executable_file2.png\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p>In computing, an <b>executable</b> is a resource that a computer can use to control its behavior. As with all information in computing, it is data, but distinct from data that does not imply a flow of control. Terms such as <b>executable code</b>, <b>executable file</b>, <b>executable program</b>, and <b>executable image</b> describe forms in which the information is represented and stored. A <b>native executable</b> is machine code and is directly executable at the instruction level of a CPU. A script is also executable although indirectly via an interpreter. Intermediate executable code may be interpreted or converted to native code at runtime via just-in-time compilation.</p>", "Bjarne_Stroustrup": "<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Bjarne_Stroustrup_%282013%29.jpg/330px-Bjarne_Stroustrup_%282013%29.jpg\" alt=\"Wikipedia thumbnail\" style=\"float:left; margin-right:10px;\"><p><b>Bjarne Stroustrup</b> is a Danish computer scientist, known for the development of the C++ programming language. He led the Large-scale Programming Research department at Bell Labs, served as a professor of computer science at Texas A&amp;M University, and spent over a decade at Morgan Stanley while also being a visiting professor at Columbia University. Since 2022 he has been a full professor at Columbia.</p>"}